AmrGaber1/Register-file-definition-for-Atmega32/Python def Automate/register_definition_file_23_09_23_07_49_44.h
/*Register: DDRB*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PINB0 :1;
		uint8 PINB1 :1;
		uint8 PINB2 :1;
		uint8 PINB3 :1;
		uint8 PINB4 :1;
		uint8 PINB5 :1;
		uint8 PINB6 :1;
		uint8 PINB7 :1;
	}Bits;
}DDRB_reg_type;
/*DDRB Address Access Macro*/
#define DDRB_REG      (*(volatile DDRB_reg_type * const)0x37)
/*DDRB Bit Macros*/
#define _DDRB_PINB0_POSITION            0x0
#define _DDRB_PINB0_MASK                0x1
#define _DDRB_PINB1_POSITION            0x1
#define _DDRB_PINB1_MASK                0x2
#define _DDRB_PINB2_POSITION            0x2
#define _DDRB_PINB2_MASK                0x4
#define _DDRB_PINB3_POSITION            0x3
#define _DDRB_PINB3_MASK                0x8
#define _DDRB_PINB4_POSITION            0x4
#define _DDRB_PINB4_MASK                0x10
#define _DDRB_PINB5_POSITION            0x5
#define _DDRB_PINB5_MASK                0x20
#define _DDRB_PINB6_POSITION            0x6
#define _DDRB_PINB6_MASK                0x40
#define _DDRB_PINB7_POSITION            0x7
#define _DDRB_PINB7_MASK                0x80


/*Register: PINB*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PINB0 :1;
		uint8 PINB1 :1;
		uint8 PINB2 :1;
		uint8 PINB3 :1;
		uint8 PINB4 :1;
		uint8 PINB5 :1;
		uint8 PINB6 :1;
		uint8 PINB7 :1;
	}Bits;
}PINB_reg_type;
/*PINB Address Access Macro*/
#define PINB_REG      (*(volatile PINB_reg_type * const)0x36)
/*PINB Bit Macros*/
#define _PINB_PINB0_POSITION            0x0
#define _PINB_PINB0_MASK                0x1
#define _PINB_PINB1_POSITION            0x1
#define _PINB_PINB1_MASK                0x2
#define _PINB_PINB2_POSITION            0x2
#define _PINB_PINB2_MASK                0x4
#define _PINB_PINB3_POSITION            0x3
#define _PINB_PINB3_MASK                0x8
#define _PINB_PINB4_POSITION            0x4
#define _PINB_PINB4_MASK                0x10
#define _PINB_PINB5_POSITION            0x5
#define _PINB_PINB5_MASK                0x20
#define _PINB_PINB6_POSITION            0x6
#define _PINB_PINB6_MASK                0x40
#define _PINB_PINB7_POSITION            0x7
#define _PINB_PINB7_MASK                0x80


/*Register: PORTC*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PINC0 :1;
		uint8 PINC1 :1;
		uint8 PINC2 :1;
		uint8 PINC3 :1;
		uint8 PINC4 :1;
		uint8 PINC5 :1;
		uint8 PINC6 :1;
		uint8 PINC7 :1;
	}Bits;
}PORTC_reg_type;
/*PORTC Address Access Macro*/
#define PORTC_REG      (*(volatile PORTC_reg_type * const)0x35)
/*PORTC Bit Macros*/
#define _PORTC_PINC0_POSITION           0x0
#define _PORTC_PINC0_MASK               0x1
#define _PORTC_PINC1_POSITION           0x1
#define _PORTC_PINC1_MASK               0x2
#define _PORTC_PINC2_POSITION           0x2
#define _PORTC_PINC2_MASK               0x4
#define _PORTC_PINC3_POSITION           0x3
#define _PORTC_PINC3_MASK               0x8
#define _PORTC_PINC4_POSITION           0x4
#define _PORTC_PINC4_MASK               0x10
#define _PORTC_PINC5_POSITION           0x5
#define _PORTC_PINC5_MASK               0x20
#define _PORTC_PINC6_POSITION           0x6
#define _PORTC_PINC6_MASK               0x40
#define _PORTC_PINC7_POSITION           0x7
#define _PORTC_PINC7_MASK               0x80


/*Register: DDRC*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PINC0 :1;
		uint8 PINC1 :1;
		uint8 PINC2 :1;
		uint8 PINC3 :1;
		uint8 PINC4 :1;
		uint8 PINC5 :1;
		uint8 PINC6 :1;
		uint8 PINC7 :1;
	}Bits;
}DDRC_reg_type;
/*DDRC Address Access Macro*/
#define DDRC_REG      (*(volatile DDRC_reg_type * const)0x34)
/*DDRC Bit Macros*/
#define _DDRC_PINC0_POSITION            0x0
#define _DDRC_PINC0_MASK                0x1
#define _DDRC_PINC1_POSITION            0x1
#define _DDRC_PINC1_MASK                0x2
#define _DDRC_PINC2_POSITION            0x2
#define _DDRC_PINC2_MASK                0x4
#define _DDRC_PINC3_POSITION            0x3
#define _DDRC_PINC3_MASK                0x8
#define _DDRC_PINC4_POSITION            0x4
#define _DDRC_PINC4_MASK                0x10
#define _DDRC_PINC5_POSITION            0x5
#define _DDRC_PINC5_MASK                0x20
#define _DDRC_PINC6_POSITION            0x6
#define _DDRC_PINC6_MASK                0x40
#define _DDRC_PINC7_POSITION            0x7
#define _DDRC_PINC7_MASK                0x80


/*Register: PINC*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PINC0 :1;
		uint8 PINC1 :1;
		uint8 PINC2 :1;
		uint8 PINC3 :1;
		uint8 PINC4 :1;
		uint8 PINC5 :1;
		uint8 PINC6 :1;
		uint8 PINC7 :1;
	}Bits;
}PINC_reg_type;
/*PINC Address Access Macro*/
#define PINC_REG      (*(volatile PINC_reg_type * const)0x33)
/*PINC Bit Macros*/
#define _PINC_PINC0_POSITION            0x0
#define _PINC_PINC0_MASK                0x1
#define _PINC_PINC1_POSITION            0x1
#define _PINC_PINC1_MASK                0x2
#define _PINC_PINC2_POSITION            0x2
#define _PINC_PINC2_MASK                0x4
#define _PINC_PINC3_POSITION            0x3
#define _PINC_PINC3_MASK                0x8
#define _PINC_PINC4_POSITION            0x4
#define _PINC_PINC4_MASK                0x10
#define _PINC_PINC5_POSITION            0x5
#define _PINC_PINC5_MASK                0x20
#define _PINC_PINC6_POSITION            0x6
#define _PINC_PINC6_MASK                0x40
#define _PINC_PINC7_POSITION            0x7
#define _PINC_PINC7_MASK                0x80


/*Register: PORTD*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PIND0 :1;
		uint8 PIND1 :1;
		uint8 PIND2 :1;
		uint8 PIND3 :1;
		uint8 PIND4 :1;
		uint8 PIND5 :1;
		uint8 PIND6 :1;
		uint8 PIND7 :1;
	}Bits;
}PORTD_reg_type;
/*PORTD Address Access Macro*/
#define PORTD_REG      (*(volatile PORTD_reg_type * const)0x32)
/*PORTD Bit Macros*/
#define _PORTD_PIND0_POSITION           0x0
#define _PORTD_PIND0_MASK               0x1
#define _PORTD_PIND1_POSITION           0x1
#define _PORTD_PIND1_MASK               0x2
#define _PORTD_PIND2_POSITION           0x2
#define _PORTD_PIND2_MASK               0x4
#define _PORTD_PIND3_POSITION           0x3
#define _PORTD_PIND3_MASK               0x8
#define _PORTD_PIND4_POSITION           0x4
#define _PORTD_PIND4_MASK               0x10
#define _PORTD_PIND5_POSITION           0x5
#define _PORTD_PIND5_MASK               0x20
#define _PORTD_PIND6_POSITION           0x6
#define _PORTD_PIND6_MASK               0x40
#define _PORTD_PIND7_POSITION           0x7
#define _PORTD_PIND7_MASK               0x80


/*Register: DDRD*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PIND0 :1;
		uint8 PIND1 :1;
		uint8 PIND2 :1;
		uint8 PIND3 :1;
		uint8 PIND4 :1;
		uint8 PIND5 :1;
		uint8 PIND6 :1;
		uint8 PIND7 :1;
	}Bits;
}DDRD_reg_type;
/*DDRD Address Access Macro*/
#define DDRD_REG      (*(volatile DDRD_reg_type * const)0x31)
/*DDRD Bit Macros*/
#define _DDRD_PIND0_POSITION            0x0
#define _DDRD_PIND0_MASK                0x1
#define _DDRD_PIND1_POSITION            0x1
#define _DDRD_PIND1_MASK                0x2
#define _DDRD_PIND2_POSITION            0x2
#define _DDRD_PIND2_MASK                0x4
#define _DDRD_PIND3_POSITION            0x3
#define _DDRD_PIND3_MASK                0x8
#define _DDRD_PIND4_POSITION            0x4
#define _DDRD_PIND4_MASK                0x10
#define _DDRD_PIND5_POSITION            0x5
#define _DDRD_PIND5_MASK                0x20
#define _DDRD_PIND6_POSITION            0x6
#define _DDRD_PIND6_MASK                0x40
#define _DDRD_PIND7_POSITION            0x7
#define _DDRD_PIND7_MASK                0x80


/*Register: PIND*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PIND0 :1;
		uint8 PIND1 :1;
		uint8 PIND2 :1;
		uint8 PIND3 :1;
		uint8 PIND4 :1;
		uint8 PIND5 :1;
		uint8 PIND6 :1;
		uint8 PIND7 :1;
	}Bits;
}PIND_reg_type;
/*PIND Address Access Macro*/
#define PIND_REG      (*(volatile PIND_reg_type * const)0x30)
/*PIND Bit Macros*/
#define _PIND_PIND0_POSITION            0x0
#define _PIND_PIND0_MASK                0x1
#define _PIND_PIND1_POSITION            0x1
#define _PIND_PIND1_MASK                0x2
#define _PIND_PIND2_POSITION            0x2
#define _PIND_PIND2_MASK                0x4
#define _PIND_PIND3_POSITION            0x3
#define _PIND_PIND3_MASK                0x8
#define _PIND_PIND4_POSITION            0x4
#define _PIND_PIND4_MASK                0x10
#define _PIND_PIND5_POSITION            0x5
#define _PIND_PIND5_MASK                0x20
#define _PIND_PIND6_POSITION            0x6
#define _PIND_PIND6_MASK                0x40
#define _PIND_PIND7_POSITION            0x7
#define _PIND_PIND7_MASK                0x80


